posts/2026-03-17-plasma-login-manager-fingerprint-login.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Plasma Login Manager 指纹登录</title>
<meta name="description" content="在现代 Linux 系统中，基本都是使用 fprint 来便捷的使用指纹识别的功能，其内置的 PAM 模块可以用于用户指纹登录系统。">
<meta name="keywords" content="Linux, KDE, Plasma">
<meta name="generator" content="Org Mode">
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="stylesheet" type="text/css" href="/css/main.bundle.min.css">
</head>
<body>
<header id="preamble" class="status">
<div class="site-header">
  <a class="site-title" href="/">Chuck</a>
  <div class="site-nav">
    <div id="menu-list" class="main-menu">
      <a href="/posts/">Posts</a>
      <a href="/about.html">About</a>
    </div>
    <button aria-label="Search" onclick="window.location.href='/search.html';">
      <svg width="20" height="20" viewBox="0 0 24 24">
        <path fill="currentcolor" d="M23.822 20.88l-6.353-6.354c.93-1.465 1.467-3.2 1.467-5.059.001-5.219-4.247-9.467-9.468-9.467s-9.468 4.248-9.468 9.468c0 5.221 4.247 9.469 9.468 9.469 1.768 0 3.421-.487 4.839-1.333l6.396 6.396 3.119-3.12zm-20.294-11.412c0-3.273 2.665-5.938 5.939-5.938 3.275 0 5.94 2.664 5.94 5.938 0 3.275-2.665 5.939-5.94 5.939-3.274 0-5.939-2.664-5.939-5.939z"></path>
      </svg>
    </button>
    <button id="appearance-switcher" aria-label="Appearance Switcher">
      <svg id="moon" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z">
        </path>
      </svg>
      <svg id="sun" width="20" height="20" viewBox="0 0 512 512">
        <path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z">
        </path>
      </svg>
    </button>
    <button id="menu-button" aria-label="Menu">
      <svg width="20" height="20" viewBox="0 0 448 512">
        <path fill="currentcolor" d="M0 96C0 78.33 14.33 64 32 64H416c17.7.0 32 14.33 32 32 0 17.7-14.3 32-32 32H32C14.33 128 0 113.7.0 96zM0 256c0-17.7 14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32H32c-17.67.0-32-14.3-32-32zM416 448H32c-17.67.0-32-14.3-32-32s14.33-32 32-32H416c17.7.0 32 14.3 32 32s-14.3 32-32 32z">
        </path>
      </svg>
    </button>
  </div>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Plasma Login Manager 指纹登录</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#使用前提">使用前提</a></li>
<li><a href="#安装">安装</a></li>
<li><a href="#录入指纹">录入指纹</a></li>
<li><a href="#配置指纹登录">配置指纹登录</a></li>
</ul>
</div>
</nav>
<p>
在现代 Linux 系统中，基本都是使用 <a href="https://fprint.freedesktop.org/">fprint</a> 来便捷的使用指纹识别的功能，其内置的 PAM 模块可以用于用户指纹登录系统。
</p>
<section id="outline-container-使用前提" class="outline-2">
<h2 id="使用前提">使用前提</h2>
<div class="outline-text-2" id="text-使用前提">
<p>
通过 lsusb 命令找到指纹识别设备，对比 <a href="https://fprint.freedesktop.org/supported-devices.html">fprint 的兼容设备清单</a>来确定设备是否已支持，不支持的设备就没法使用了。
</p>
</div>
</section>
<section id="outline-container-安装" class="outline-2">
<h2 id="安装">安装</h2>
<div class="outline-text-2" id="text-安装">
<p>
Arch Linux 下使用 sudo pacman -S fprintd libfprint 命令进行安装。
</p>

<p>
启动 fprintd 服务并设置为开机自启动：
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo systemctl start fprintd.service
sudo systemctl enable fprintd.service
</pre>
</div>

<p>
可能会提示启动依赖的问题，使用命令 sudo systemctl edit –full –force fprintd.service 修改服务配置文件：
</p>

<div class="org-src-container">
<pre class="src src-ini">[Install]
WantedBy=multi-user.target
</pre>
</div>

<p>
使用命令 sudo systemctl daemon-reload 重新加载服务配置文件就可以解决问题了。
</p>
</div>
</section>
<section id="outline-container-录入指纹" class="outline-2">
<h2 id="录入指纹">录入指纹</h2>
<div class="outline-text-2" id="text-录入指纹">
<p>
运行 fprintd-enroll 命令就可以为当前用户录入指纹，默认是录入右手食指指纹，也可以指定录入不同的手指指纹，参考<a href="https://man.archlinux.org/man/fprintd.1">命令行手册</a>。
</p>

<div class="org-src-container">
<pre class="src src-bash">fprintd-enroll -f right-index-finger
fprintd-enroll -f right-middle-finger
</pre>
</div>

<p>
录入完成后，可以使用 fprintd-verify -f <i>finger</i> 来验证指纹，使用 fprintd-delete -f <i>finger</i> 来删除指纹。
</p>
</div>
</section>
<section id="outline-container-配置指纹登录" class="outline-2">
<h2 id="配置指纹登录">配置指纹登录</h2>
<div class="outline-text-2" id="text-配置指纹登录">
<p>
要在 Plasma Login Manager 中使用指纹登录，需要修改 /etc/pam.d/plasmalogin 配置文件，如果没有就从 /usr/lib/pam.d/plasmalogin 拷贝一个过来。
</p>

<p>
将 pam_fprintd.so 添加到 auth 认证的开头位置：
</p>

<div class="org-src-container">
<pre class="src src-text">...
# SPDX-License-Identifier: CC0-1.0
# SPDX-FileCopyrightText: none

auth        sufficient  pam_fprintd.so
auth        include     system-login
-auth       optional    pam_gnome_keyring.so
-auth       optional    pam_kwallet5.so
...
</pre>
</div>

<p>
在系统启动登录界面或锁屏界面时，直接敲击回车键，就可以使用指纹认证登录了。
</p>

<blockquote>
<p>
默认情况下指纹登录时不会解锁 KWallet ，使用 KWallet 时会弹出密码输入框进行认证，自动解锁可以参考 <a href="https://wiki.archlinuxcn.org/wiki/KDE_Wallet#%E7%99%BB%E5%BD%95%E6%97%B6%E8%87%AA%E5%8A%A8%E8%A7%A3%E9%94%81_Kwallet">KWallet Wiki 指导</a>。
</p>
</blockquote>
</div>
</section>
</main>
<footer id="postamble" class="status">
<div class="site-footer">
  <p>&copy 2026 Chuck</p>
  <p>Powered by <a href="https://www.gnu.org/software/emacs/">Emacs</a></p>
</div>
<a href="#top" class="top-link" id="top-link" style="visibility: hidden; opacity: 0;">
  <svg xmlns="http://www.w3.org/2000/svg" height="24px" width="24px" viewBox="0 -960 960 960" fill="currentcolor">
    <path d="M440-160v-487L216-423l-56-57 320-320 320 320-56 57-224-224v487h-80Z"></path>
  </svg>
</a>
</footer>
</body>
</html>
